#include <stdio.h>

int drawRect(int width, int height){

    int i;
    int j;

    if (width <= height){
        for (i = 1; i <= width; i++){
            for (j = 1; j <= height; j++){
                putchar('*');
            }
            putchar('\n');
        }
    }
    else{
        for (i = 1; i <= height; i++){
            for (j = 1; j <= width; j++){
                putchar('*');
            }
            putchar('\n');
        }
    }

    return 0;
}

int main(){

    int N = 6;
    int I = 0;
    int area_01 = 0;
    int area_02 = 0;

    printf("横と縦の数値を入力してください。");
    scanf("%d", &area_01);
    scanf("%d", &area_02);
    printf("長方形を表示します。\n\n");
    while(I < N){
        I++;
        drawRect(area_01, area_02);
        area_01 = area_01 + 2;
        area_02 = area_02 + 2;
        putchar('\n');
    }
}

/*

横と縦の数値を入力してください。2 
3
長方形を表示します。

***
***

*****
*****
*****
*****

*******
*******
*******
*******
*******
*******

*********
*********
*********
*********
*********
*********
*********
*********

***********
***********
***********
***********
***********
***********
***********
***********
***********
***********

*************
*************
*************
*************
*************
*************
*************
*************
*************
*************
*************
*************

*/